Senrli/nrf51-sdk/nRF5_SDK_12.3.0_d7731ad/components/libraries/timer/app_timer.c
        user_op_enque(last_index);
    }
    CRITICAL_REGION_EXIT();

    if (err_code == NRF_SUCCESS)
    {
        timer_list_handler_sched();
    }

    return err_code;
}

/**@brief Function for handling the RTC1 interrupt.
 *
 * @details Checks for timeouts, and executes timeout handlers for expired timers.
 */
void RTC1_IRQHandler(void)
{
    // Clear all events (also unexpected ones)
    NRF_RTC1->EVENTS_COMPARE[0] = 0;
    NRF_RTC1->EVENTS_COMPARE[1] = 0;
    NRF_RTC1->EVENTS_COMPARE[2] = 0;
    NRF_RTC1->EVENTS_COMPARE[3] = 0;
    NRF_RTC1->EVENTS_TICK       = 0;
    NRF_RTC1->EVENTS_OVRFLW     = 0;

    // Check for expired timers
    timer_timeouts_check();
}


/**@brief Function for handling the SWI interrupt.
 *
 * @details Performs all updates to the timer list.
 */
void SWI_IRQHandler(void)
{
    timer_list_handler();
}

/**
 * Internal function to enable overflow counter 
 * for system clock tick events.
 * 
 * Adapted from https://devzone.nordicsemi.com/f/nordic-q-a/29013/best-way-to-implement-system-clock-on-nrf51 and
 * https://gist.github.com/clemtaylor/26da578862ffe083bf72
 * 
 * 
*/
static void overflow_init(void)
{
    APP_TIMER_OVERFLOW_COUNTER->POWER          = 1;
    APP_TIMER_OVERFLOW_COUNTER->TASKS_SHUTDOWN = 1;
    APP_TIMER_OVERFLOW_COUNTER->TASKS_CLEAR    = 1;
    APP_TIMER_OVERFLOW_COUNTER->INTENCLR       = -1; // disable all
    APP_TIMER_OVERFLOW_COUNTER->MODE           = TIMER_MODE_MODE_Counter;
    APP_TIMER_OVERFLOW_COUNTER->BITMODE        = TIMER_BITMODE_BITMODE_32Bit << TIMER_BITMODE_BITMODE_Pos;
    APP_TIMER_OVERFLOW_COUNTER->PRESCALER      = 0;
    APP_TIMER_OVERFLOW_COUNTER->SHORTS         = 0;

    sd_ppi_channel_assign(APP_TIMER_PPI_CHANNEL_OVERFLOW,
        &NRF_RTC1->EVENTS_OVRFLW,
        &APP_TIMER_OVERFLOW_COUNTER->TASKS_COUNT);

    sd_ppi_channel_enable_set(1 << APP_TIMER_PPI_CHANNEL_OVERFLOW);

    APP_TIMER_OVERFLOW_COUNTER->TASKS_START = 1;
}


uint32_t app_timer_init(uint32_t                      prescaler,
                        uint8_t                       op_queue_size,
                        void *                        p_buffer,
                        app_timer_evt_schedule_func_t evt_schedule_func)
{
    // Check that buffer is correctly aligned
    if (!is_word_aligned(p_buffer))
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    // Check for NULL buffer
    if (p_buffer == NULL)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    // Stop RTC to prevent any running timers from expiring (in case of reinitialization)
    rtc1_stop();

    m_evt_schedule_func = evt_schedule_func;

    // Initialize operation queue
    m_op_queue.first           = 0;
    m_op_queue.last            = 0;
    m_op_queue.size            = op_queue_size;
    m_op_queue.p_user_op_queue = p_buffer;

    mp_timer_id_head            = NULL;
    m_ticks_elapsed_q_read_ind  = 0;
    m_ticks_elapsed_q_write_ind = 0;

#if APP_TIMER_WITH_PROFILER
    m_max_user_op_queue_utilization   = 0;
#endif

    NVIC_ClearPendingIRQ(SWI_IRQn);
    NVIC_SetPriority(SWI_IRQn, SWI_IRQ_PRI);
    NVIC_EnableIRQ(SWI_IRQn);

    rtc1_init(prescaler);

    overflow_init();                 /* Added overflow counter init procedure */

    m_ticks_latest = rtc1_counter_get();

    return NRF_SUCCESS;
}


uint32_t app_timer_create(app_timer_id_t const *      p_timer_id,
                          app_timer_mode_t            mode,
                          app_timer_timeout_handler_t timeout_handler)
{
    // Check state and parameters
    VERIFY_MODULE_INITIALIZED();

    if (timeout_handler == NULL)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    if (p_timer_id == NULL)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    if (((timer_node_t*)*p_timer_id)->is_running)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    timer_node_t * p_node     = (timer_node_t *)*p_timer_id;
    p_node->is_running        = false;
    p_node->mode              = mode;
    p_node->p_timeout_handler = timeout_handler;
    return NRF_SUCCESS;
}

uint32_t app_timer_start(app_timer_id_t timer_id, uint32_t timeout_ticks, void * p_context)
{
    uint32_t timeout_periodic;
    timer_node_t * p_node = (timer_node_t*)timer_id;

    // Check state and parameters
    VERIFY_MODULE_INITIALIZED();

    if (timer_id == 0)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    if (timeout_ticks < APP_TIMER_MIN_TIMEOUT_TICKS)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    if (p_node->p_timeout_handler == NULL)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    // Schedule timer start operation
    timeout_periodic = (p_node->mode == APP_TIMER_MODE_REPEATED) ? timeout_ticks : 0;

    return timer_start_op_schedule(p_node,
                                   timeout_ticks,
                                   timeout_periodic,
                                   p_context);
}


uint32_t app_timer_stop(app_timer_id_t timer_id)
{
    timer_node_t * p_node = (timer_node_t*)timer_id;
    // Check state and parameters
    VERIFY_MODULE_INITIALIZED();

    if ((timer_id == NULL) || (p_node->p_timeout_handler == NULL))
    {
        return NRF_ERROR_INVALID_STATE;
    }

    p_node->is_running = false;
    // Schedule timer stop operation
    return timer_stop_op_schedule(p_node, TIMER_USER_OP_TYPE_STOP);
}


uint32_t app_timer_stop_all(void)
{
    // Check state
    VERIFY_MODULE_INITIALIZED();

    return timer_stop_op_schedule(NULL, TIMER_USER_OP_TYPE_STOP_ALL);
}


uint32_t app_timer_cnt_get(void)
{
    return rtc1_counter_get();
}

void app_timer_ticks(uint32_t *p_overflow, uint32_t *p_ticks)
{
    uint32_t overflow0, overflow1, counter;

    APP_TIMER_OVERFLOW_COUNTER->TASKS_CAPTURE[0] = 1; // trigger capture
    overflow0 = APP_TIMER_OVERFLOW_COUNTER->CC[0]; // before
    counter   = NRF_RTC1->COUNTER;
    APP_TIMER_OVERFLOW_COUNTER->TASKS_CAPTURE[1] = 1; // trigger capture
    overflow1 = APP_TIMER_OVERFLOW_COUNTER->CC[1]; // after

    if (overflow0 != overflow1)
    {
        /* overflow occurred (rare)
         * we don't know if overflow1 changed before or after
         * we sampled counter1, so we just sample again
         */
        counter = NRF_RTC1->COUNTER;
    }

    *p_overflow = overflow1;
    *p_ticks    = counter;
}

uint32_t app_timer_cnt_diff_compute(uint32_t   ticks_to,
                                    uint32_t   ticks_from,
                                    uint32_t * p_ticks_diff)
{
    *p_ticks_diff = ticks_diff_get(ticks_to, ticks_from);
    return NRF_SUCCESS;
}

#if APP_TIMER_WITH_PROFILER
uint8_t app_timer_op_queue_utilization_get(void)
{
    return m_max_user_op_queue_utilization;
}
#endif
#endif //NRF_MODULE_ENABLED(APP_TIMER)
